20210913142007-veos_paper.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-paper</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">veos-paper</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9666376">motivation</a></li>
<li><a href="#org08bb5c9">sota</a></li>
<li><a href="#org7985232">method</a>
<ul>
<li><a href="#orge73fa58">model</a>
<ul>
<li><a href="#org3057ab4">vehicle dynamic system modeling</a></li>
<li><a href="#orga0e15ba">reinforcement learning model</a></li>
</ul>
</li>
<li><a href="#orgdae0499">time sequence is important for exact reward</a></li>
<li><a href="#org76052ae">data pool with dask and mongodb for easy sampling, storing, indexing, data interface with DataFrame with every timestamps</a></li>
</ul>
</li>
<li><a href="#orgaba01f8">experiment results discussion</a>
<ul>
<li><a href="#orge152b5a">ddpg</a></li>
<li><a href="#org7f6d779">driving style hinted at a common reward of human drive and agent</a></li>
<li><a href="#orge63781c">rdpg</a></li>
</ul>
</li>
<li><a href="#org53f4bef">broader impact</a></li>
</ul>
</div>
</div>
<p>
:ID:       f949414e-7ddf-4d0f-b2b0-d27c2644a498
</p>
<p>
<a href="./20210830182658-veos.html">veos</a>
</p>
<div id="outline-container-org9666376" class="outline-2">
<h2 id="org9666376">motivation</h2>
<div class="outline-text-2" id="text-org9666376">
<p>
alex irpan paper post why reinforcement leanring does not work yet in the real world
scaling up model, is not the case
</p>
<ol class="org-ol">
<li>Simulation atari</li>
<li>Carla</li>
<li>server cluster VAC</li>
<li>Bonsai</li>
</ol>

<p>
make some progress, any progress in the application;
</p>


<p>
learning based.
</p>

<p>
driving decision with short horizon has an impact on the overall energy consumption
</p>

<p>
no realtime requirement, based on the scenario, minutes would be sufficient. actuallly the luxuray of seconds updating the nearby rows of torque table.
</p>

<p>
Contextual Information like NLU different scenario, any action is like tokens. &#x2013;&gt; Sequential decision by transformer/RNN
</p>
</div>
</div>


<div id="outline-container-org08bb5c9" class="outline-2">
<h2 id="org08bb5c9">sota</h2>
</div>

<div id="outline-container-org7985232" class="outline-2">
<h2 id="org7985232">method</h2>
<div class="outline-text-2" id="text-org7985232">
</div>
<div id="outline-container-orge73fa58" class="outline-3">
<h3 id="orge73fa58">model</h3>
<div class="outline-text-3" id="text-orge73fa58">
</div>
<div id="outline-container-org3057ab4" class="outline-4">
<h4 id="org3057ab4">vehicle dynamic system modeling</h4>
<div class="outline-text-4" id="text-org3057ab4">
</div>
<ul class="org-ul">
<li><a id="orgd7daf0b"></a>general model<br /></li>
</ul>
</div>
<div id="outline-container-orga0e15ba" class="outline-4">
<h4 id="orga0e15ba">reinforcement learning model</h4>
<div class="outline-text-4" id="text-orga0e15ba">
</div>
<ul class="org-ul">
<li><a id="orgf6bc1a0"></a>action model: torque model, translational mixed gaussian model, with speed translation invariance<br />
<div class="outline-text-5" id="text-orgf6bc1a0">
<p>
equation
</p>
</div>
</li>
<li><a id="org731b32a"></a>observation model: state,<br />
<div class="outline-text-5" id="text-org731b32a">
<p>
equation
</p>
</div>
</li>
<li><a id="org394bba3"></a>reward model<br /></li>
<li><a id="org2ff3686"></a>driver model<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgdae0499" class="outline-3">
<h3 id="orgdae0499">time sequence is important for exact reward</h3>
</div>
<div id="outline-container-org76052ae" class="outline-3">
<h3 id="org76052ae">data pool with dask and mongodb for easy sampling, storing, indexing, data interface with DataFrame with every timestamps</h3>
</div>
</div>

<div id="outline-container-orgaba01f8" class="outline-2">
<h2 id="orgaba01f8">experiment results discussion</h2>
<div class="outline-text-2" id="text-orgaba01f8">
</div>
<div id="outline-container-orge152b5a" class="outline-3">
<h3 id="orge152b5a">ddpg</h3>
<div class="outline-text-3" id="text-orge152b5a">
<p>
short period of attention window
</p>
</div>
</div>
<div id="outline-container-org7f6d779" class="outline-3">
<h3 id="org7f6d779">driving style hinted at a common reward of human drive and agent</h3>
</div>

<div id="outline-container-orge63781c" class="outline-3">
<h3 id="orge63781c">rdpg</h3>
<div class="outline-text-3" id="text-orge63781c">
<p>
long episode truncated BPTT long period of attention window
episode management, training selection,
</p>

<p>
RLHF? easy way with empirical distribution no sequential model, first ignore the time sequence, just to look at the difference.
</p>
</div>
</div>
</div>

<div id="outline-container-org53f4bef" class="outline-2">
<h2 id="org53f4bef">broader impact</h2>
<div class="outline-text-2" id="text-org53f4bef">
<p>
federated learning for meta learning,evolving
NAS,
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
